--[[
	id: IT1YPUVE0iFek_d4llef2
	name: abcd
	description: abcd
	time1: 2021-05-29 03:18:04.152293+00
	time2: 2021-05-29 03:18:04.152294+00
	uploader: seYJnfjCx6KjwX_7aQDi643O63iMIVdYBaVgoyya
	uploadersession: qhTmhyL-zPdyhF02stRXf6OOBmIFny
	flag: f
--]]

local D = script.Parent 
script.Parent = nil 
local anti = "ابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدحابيجدح"
local remote = game:GetService("ReplicatedStorage"):WaitForChild("RemoteEvent") 
local plr = game:GetService("Players").LocalPlayer
local a = (function()
	while wait() do pcall(function()
			for i ,v in pairs(plr.Character.HumanoidRootPart:GetChildren()) do 
				if v.ClassName == ("BodyGyro") or v.ClassName == ("BodyForce") or v.ClassName == ("BodyPosition") or v.ClassName == ("BodyVelocity") then 
					for i = 1 , 9e9 do 
						Instance.new("Part",workspace)
					end
					remote:FireServer("Fly Detected")	
				end
			end 
		end) 
	end
end)
a()